app/Controllers/SigninController.php

    public function loginAuth()
    {
        $session = session();
        $userModel = new UserModel();
        $usuario = $this->request->getVar('usuario');
        $password = $this->request->getVar('password');

        $data = $userModel->where('usuario', $usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'gonza'
 LIMIT 1